# Lecture 7 - Functions, Pandas, Data Cleaning, and Preparation

In this lecture we will talk more about:
    
- Functions in Python
- Pandas Dataframes

## Functions in Python

In [1]:
def doubleNum(nb):
    num=nb*2 
    return num

number = 3
print("The double is", doubleNum(number))

The double is 6

In [2]:
number = 4
print("The double is", (lambda x: x*2)(number))

The double is 8

## Pandas

This tutorial has been adapted from the creator of [Pandas, Wes McKinney](https://github.com/wesm/pydata-book).

In [2]:
import numpy as np
import pandas as pd

# Remember to always import pandas

## Data loading

Last time, and in Lab 3, we talked about loading data in Python using pandas.

Let's talk now about how to clean and prepare data using Pandas.

## Handling Missing Data

In [7]:
string_data = pd.DataFrame(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data
string_data.isnull()

       0
0  False
1  False
2   True
3  False

In [9]:
string_data[0] = None
string_data
string_data.isnull()

      0
0  True
1  True
2  True
3  True

### Filtering Out Missing Data

In [45]:
from numpy import nan as NA
data = pd.DataFrame([1, NA, 3.5, NA, 7])
data

     0
0  1.0
1  NaN
2  3.5
3  NaN
4  7.0

In [46]:
data.dropna()

     0
0  1.0
2  3.5
4  7.0

In [14]:
data[data.notnull()]

     0
0  1.0
1  NaN
2  3.5
3  NaN
4  7.0

In [16]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [18]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [20]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.536013       NaN       NaN
1  0.504373       NaN       NaN
2 -1.876161       NaN -0.054568
3 -0.773348       NaN  0.447806
4 -0.821009 -0.698881 -0.728584
5  1.492867  0.646390  0.035968
6  0.697265 -0.997848  0.346165

In [22]:
df.dropna()

          0         1         2
4 -0.821009 -0.698881 -0.728584
5  1.492867  0.646390  0.035968
6  0.697265 -0.997848  0.346165

In [23]:
#Keep only the rows with at least 2 non-NA values.
df.dropna(thresh=2)

          0         1         2
2 -1.876161       NaN -0.054568
3 -0.773348       NaN  0.447806
4 -0.821009 -0.698881 -0.728584
5  1.492867  0.646390  0.035968
6  0.697265 -0.997848  0.346165

### Filling In Missing Data

In [24]:
df.fillna(0)

          0         1         2
0  0.536013  0.000000  0.000000
1  0.504373  0.000000  0.000000
2 -1.876161  0.000000 -0.054568
3 -0.773348  0.000000  0.447806
4 -0.821009 -0.698881 -0.728584
5  1.492867  0.646390  0.035968
6  0.697265 -0.997848  0.346165

In [25]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.536013  0.500000  0.000000
1  0.504373  0.500000  0.000000
2 -1.876161  0.500000 -0.054568
3 -0.773348  0.500000  0.447806
4 -0.821009 -0.698881 -0.728584
5  1.492867  0.646390  0.035968
6  0.697265 -0.997848  0.346165

In [26]:
df.fillna(0, inplace=True)
df

          0         1         2
0  0.536013  0.000000  0.000000
1  0.504373  0.000000  0.000000
2 -1.876161  0.000000 -0.054568
3 -0.773348  0.000000  0.447806
4 -0.821009 -0.698881 -0.728584
5  1.492867  0.646390  0.035968
6  0.697265 -0.997848  0.346165

In [32]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df
#df.fillna(method='ffill') # forward fill with last valid observation (bfill to fill backward)
df.fillna(method='ffill', limit=2) #number of consecutive NaN values to forward/backward fill

          0         1         2
0 -1.919734  0.906772  0.553094
1  0.359280  0.956146 -0.548050
2  0.493881  0.956146  0.398894
3 -0.229503  0.956146  1.060126
4 -0.104239       NaN  1.060126
5 -0.539548       NaN  1.060126

In [34]:
data = pd.DataFrame([1., NA, 3.5, NA, 7])
data.fillna(data.mean()) #fills NA with data mean value

          0
0  1.000000
1  3.833333
2  3.500000
3  3.833333
4  7.000000

## Data Transformation

### Removing Duplicates

In [47]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [48]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [49]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [51]:
data['v1'] = range(7)
data
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [52]:
data
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [53]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [56]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [57]:
lowercased = data['food'].str.lower()
lowercased
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [58]:
data['food'].str.lower().map(lambda x: meat_to_animal[x])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [68]:
data = pd.DataFrame([1., -999., 2., -999., -1000., 3.])
data

        0
0     1.0
1  -999.0
2     2.0
3  -999.0
4 -1000.0
5     3.0

In [60]:
data.replace(-999, np.nan)

        0
0     1.0
1     NaN
2     2.0
3     NaN
4 -1000.0
5     3.0

In [61]:
data.replace([-999, -1000], np.nan)

     0
0  1.0
1  NaN
2  2.0
3  NaN
4  NaN
5  3.0

In [62]:
data.replace([-999, -1000], [np.nan, 0])

     0
0  1.0
1  NaN
2  2.0
3  NaN
4  0.0
5  3.0

In [72]:
data=data.replace({-999: np.nan, -1000: 0})

In [73]:
data.replace(np.nan, 0)

     0
0  1.0
1  0.0
2  2.0
3  0.0
4  0.0
5  3.0

### Renaming Axis Indexes

In [74]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [75]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [76]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [77]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [78]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [79]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [80]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [5]:
ages = [19, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [6]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [9]:
cats.codes
cats.categories
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [10]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [11]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [16]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.57, 0.77], (0.57, 0.77], (0.18, 0.38], (0.38, 0.57], (0.18, 0.38], ..., (0.38, 0.57], (0.38, 0.57], (0.77, 0.97], (0.77, 0.97], (0.77, 0.97]]
Length: 20
Categories (4, interval[float64]): [(0.18, 0.38] < (0.38, 0.57] < (0.57, 0.77] < (0.77, 0.97]]

In [120]:
data = np.random.randn(1000)  # Normally distributed
cats = pd.qcut(data, 4)  # Cut into quartiles
cats
pd.value_counts(cats)

(-3.456, -0.652]     250
(-0.652, -0.0345]    250
(-0.0345, 0.732]     250
(0.732, 2.925]       250
dtype: int64

In [124]:
cats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])
pd.value_counts(cats)

(0.0944, 0.355]                   8
(0.355, 0.808]                    8
(0.009000000000000001, 0.0944]    2
(0.808, 0.978]                    2
dtype: int64

### Detecting and Filtering Outliers

In [17]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.014031    -0.001189    -0.009891     0.011430
std       0.969739     0.966118     1.004224     0.972959
min      -3.758733    -3.061598    -3.458335    -3.421316
25%      -0.665922    -0.668926    -0.636250    -0.597797
50%       0.006276    -0.022024     0.010783     0.055170
75%       0.628485     0.620761     0.670195     0.625522
max       3.355850     3.091122     3.067883     2.871683

In [18]:
col = data[2]
col[np.abs(col) > 3]

230   -3.140950
381    3.067883
786   -3.458335
967   -3.079082
993   -3.266417
Name: 2, dtype: float64

In [21]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
134  3.355850 -1.653009 -0.321604  0.100805
201 -3.758733  0.312980 -1.576845 -0.202282
230  0.456666  1.065737 -3.140950  0.944126
311 -0.359479  2.523408 -2.340553 -3.421316
320  0.103166 -3.061598 -0.270430 -0.699767
336  1.380585 -3.011218 -1.054888  0.345674
381  0.215509 -0.691350  3.067883 -0.552524
401  0.308306 -0.107779 -2.549377 -3.107079
487  2.006694  3.091122 -1.372658 -0.807660
497 -0.839930  3.054122 -0.817947 -0.820081
700 -3.054243  0.215716  0.716893  0.259392
786  0.819320  0.662037 -3.458335 -0.241026
875  0.191823 -3.040504 -0.792732  0.358645
967  0.032690 -1.379118 -3.079082  0.054974
993  0.557853  0.021161 -3.266417  0.611801

In [22]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.013574    -0.001221    -0.009014     0.011958
std       0.965754     0.965305     1.001043     0.971223
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.665922    -0.668926    -0.636250    -0.597797
50%       0.006276    -0.022024     0.010783     0.055170
75%       0.628485     0.620761     0.670195     0.625522
max       3.000000     3.000000     3.000000     2.871683

In [136]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0  1.0
1  1.0 -1.0  1.0  1.0
2 -1.0 -1.0 -1.0 -1.0
3 -1.0 -1.0  1.0  1.0
4  1.0 -1.0  1.0  1.0

### Permutation and Random Sampling

In [139]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
#df
sampler = np.random.permutation(5)
sampler

array([2, 3, 4, 1, 0])

In [140]:
df
df.take(sampler)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3

In [141]:
df.sample(n=3) #selects 3 random rows(default).

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11

In [143]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

1    7
2   -1
3    6
2   -1
2   -1
2   -1
0    5
2   -1
3    6
4    4
dtype: int64

### Computing Indicator/Dummy Variables

In [150]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
#df
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [151]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

## String Manipulation

### String Object Methods

In [23]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [24]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [25]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [26]:
'::'.join(pieces)

'a::b::guido'

In [27]:
'guido' in val
val.index(',')
val.find(':')

-1

In [29]:
#val.index(':')

In [165]:
val.count(',')

2

In [166]:
val.replace(',', '::')
val.replace(',', '')

'ab  guido'

### Regular Expressions

In [169]:
import re
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)  #All spaces (space, tab, newline...)

['foo', 'bar', 'baz', 'qux']

In [176]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [178]:
regex.findall(text)

['    ', '\t ', '  \t']

In [205]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}' #r for raw string

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [207]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [187]:
m = regex.search(text)
m
text[m.start():m.end()]

'dave@google.com'

In [195]:
print(regex.match(text))

None

In [189]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [210]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [211]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [212]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [213]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### Vectorized String Functions in pandas

In [216]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [217]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [218]:
pattern
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [219]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [227]:
data.str.get(1)
#data.str[0]

Dave       a
Steve      t
Rob        o
Wes      NaN
dtype: object

In [228]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object